SampleFiles/SoapDemoXml1.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetMortgagePayment xmlns="http://www.webserviceX.NET/">
      <Years>5</Years>
      <Interest>2.5</Interest>
      <LoanAmount>10000</LoanAmount>
      <AnnualTax>1</AnnualTax>
      <AnnualInsurance>0</AnnualInsurance>
    </GetMortgagePayment>
  </soap:Body>
</soap:Envelope>